Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། འོང་བ་མེད་པ་དང་འགྲོ་བ་མེད་པ་ཉེ་བར་བཟུང་བ་དང་། ཡོངས་སུ་འཛིན་པ་མེད་པ་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བ་ཡིན་ནོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the six perfections and refine the path to all-aspect omniscience because they neither come nor go, and because they are without grasping, owing to the emptiness of the unlimited. “

source: །དེ་ལ་སྦྱིན་པ་ནི་ཡོངས་སུ་འཛིན་པ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: In that regard, generosity is conceived in relation to grasping.

source: །ཚུལ་ཁྲིམས་ནི་ཚུལ་ཁྲིམས་ངན་པ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: Ethical discipline is conceived in relation to immorality.

source: །བཟོད་པ་ནི་འཁྲུག་པ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: Tolerance is conceived in relation to impatience.

source: །བརྩོན་འགྲུས་ནི་ལེ་ལོ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: Perseverance is conceived in relation to indolence.

source: །ཏིང་ངེ་འཛིན་ནི་མཉམ་པར་མ་བཞག་པ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: Meditative stability is conceived in relation to lack of absorption.

source: །ཤེས་རབ་ནི་ཤེས་རབ་འཆལ་བ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ།
en: Wisdom is conceived in relation to stupidity. “

source: །དེ་ནི་རྒལ་ཏོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I have crossed [the ocean of suffering].’

source: །མ་རྒལ་ཏོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I have not crossed [the ocean of suffering].’

source: །སྦྱིན་པ་བྱེད་དོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am giving a gift.’

source: །སྦྱིན་པ་མི་བྱེད་དོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am not giving a gift.’

source: །ཚུལ་ཁྲིམས་དང་ལྡན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I have ethical discipline.’

source: །ཚུལ་ཁྲིམས་ངན་པ་ཅན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I have poor discipline.’

source: །བཟོད་པ་ཕུན་སུམ་ཚོགས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘My tolerance is excellent.’

source: །ཁྲོ་བ་ཅན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am angry.’

source: །བརྩོན་འགྲུས་བརྩམས་པའོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am persevering.’

source: །ལེ་ལོ་ཅན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am indolent.’ {

source: །མཉམ་པར་བཞག་པའོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: Dt.90} They do not give rise to conceits, thinking, ‘I am absorbed [in meditation].’

source: །མཉམ་པར་མ་བཞག་པའོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am not absorbed [in meditation].’

source: །ཤེས་རབ་དང་ལྡན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am wise.’

source: །ཤེས་རབ་འཆལ་བ་ཅན་ནོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am stupid.’

source: །སྤྱོས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am reviled.’

source: །ཕྱག་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །རིམ་གྲོ་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I receive homage.’

source: །རིམ་གྲོ་མ་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་མ་སྐྱེས་པ་ནི་སྤྱོས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །ཕྱག་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am being served.’

source: །རིམ་གྲོ་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not give rise to conceits, thinking, ‘I am not being served.’

source: །རིམ་གྲོ་མ་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རློམ་སེམས་ཐམས་ཅད་ཡང་དག་པར་གཅོད་པའི་ཕྱིར་ཏེ།
en: If you ask why, Śāradvatīputra, it is because the perfection of wisdom cuts off all assumptions. “

source: འདི་ལ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡོན་ཏན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མེད་དེ།
en: In this regard, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, whatever enlightened attributes they possess are not found in any śrāvakas or pratyekabuddhas.

source: དེ་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཐོབ་པར་བྱེད་དོ།
en: When they have perfected those enlightened attributes, they can also bring beings to maturity, refine the buddhafields, and even attain all-aspect omniscience. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པའི་སེམས་བསྐྱེད་དེ། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་བསྐྱེད་ནས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་རབ་ཏུ་འཐོབ་བོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they will develop an attitude of equanimity toward all beings, and after having developed the attitude that all beings are the same, they will attain realization of the sameness of all phenomena.

source: །ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་རབ་ཏུ་ཐོབ་ནས། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་འགོད་དོ།
en: After having attained realization of the sameness of all phenomena, they will establish all beings in the realization of the sameness of all phenomena.

source: །དེ་ནི་ཚེ་འདི་ཉིད་ལ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་སུ་བྱོན་ཅིང་དབེན་པར་བྱ་བ་ཡིན་ཏེ།
en: In this very life, to the lord buddhas they will be pleasing and set apart.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ཉན་ཐོས་ཐམས་ཅད་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡིད་དུ་འོང་ཞིང་དབེན་པར་བྱ་བ་ཡིན་ཏེ།
en: They will also be pleasing and set apart by all bodhisattvas, all śrāvakas, and all pratyekabuddhas.

source: དེ་ནི་སྐྱེ་བ་གང་དང་གང་དུ་སྐྱེས་ཀྱང་། དེ་དང་དེ་དག་ཏུ་ནམ་ཡང་མིག་གིས་ཡིད་དུ་མི་འོང་བའི་གཟུགས་མི་མཐོང་ངོ་།
en: Wherever they are reborn, in these realms their eyes will never behold unpleasant sights.

source: །རྣ་བས་ཡིད་དུ་མི་འོང་བའི་སྒྲ་མི་ཐོས་སོ།
en: Their ears will not hear unpleasant sounds. {

source: །སྣས་ཡིད་དུ་མི་འོང་བའི་དྲི་མི་ཚོར་རོ།
en: Dt.91} Their noses will not smell unpleasant odors.

source: །ལྕེས་ཡིད་དུ་མི་འོང་བའི་རོ་མི་མྱོང་ངོ་།
en: Their tongues will not savor unpleasant tastes.

source: །ལུས་ཀྱིས་ཡིད་དུ་མི་འོང་བའི་རེག་བྱ་མི་རེག་གོ།
en: Their bodies will not touch unpleasant tangibles.

source: །ཡིད་ཀྱིས་ཡིད་དུ་མི་འོང་བའི་ཆོས་རྣམ་པར་རིག་པ་མེད་དོ།
en: Their mental faculties will not experience unpleasant mental phenomena.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they will not degenerate from unsurpassed, complete enlightenment.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་འདི་བསྟན་པའི་ཚེ། དགེ་སློང་སུམ་བརྒྱས་གོས་གྱོན་གྱོན་པ། བཅོམ་ལྡན་འདས་ལ་ཡོན་དུ་གསོལ་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When this teaching of the perfection of wisdom was being revealed, three hundred monks, wearing their monastic robes, presented offerings to the Blessed One and set their minds on unsurpassed, complete enlightenment.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ། དགེ་སློང་རྣམས་ཀྱི་བསམ་པ་མཁྱེན་ནས་ཞལ་འཛུམ་པ་མཛད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་དེ་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: Thereupon, the Blessed One smiled on that occasion, knowing the aspirations of those monks.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་བཞད་པ་མི་མཛད་ན། ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་ཞལ་འཛུམ་པ་མཛད།
en: Then the venerable Ānanda, rising from his seat, with his upper robe over one shoulder, rested his right knee on the ground and, placing his hands together in the gesture of homage, bowed toward the Blessed One and asked, “Blessed Lord, since the tathāgatas, arhats, completely awakened buddhas do not smile without reason or circumstances, what is the reason and what are the circumstances for your smile?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་དགེ་སློང་སུམ་བརྒྱ་པོ་འདི་དག་ནི་བསྐལ་པ་དྲུག་ཅུ་རྩ་གཅིག་འདས་ནས། བསྐལ་པ་དཔེ་སྐར་མ་ལྟ་བུ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་ཆེན་པོ་ཞེས་བྱ་བ་ཤ་སྟག་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །འདི་དག་ནི་འདི་ནས་ཤི་འཕོས་ནས།
en: The Blessed One replied to the venerable Ānanda, “Ānanda, when sixty-one eons have passed, during the eon called Starlike these three hundred monks will all appear in the world [alongside] the tathāgata, arhat, completely awakened buddha named Mahāketu, and having passed away from there, they will be reborn in the buddhafield of the tathāgata, arhat, completely awakened buddha named Akṣobhya.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་སྒུལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེའོ། །འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་སྟོང་ཕྲག་དྲུག་ཅུས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་མཉེས་པར་བྱེད་པར་འགྱུར་རོ།
en: Sixty thousand gods who frequent the realm of desire will also set their minds on unsurpassed, complete enlightenment, and they will also please the tathāgata, arhat, completely awakened buddha named Maitreya. {

source: །དེ་ཉིད་དུ་རབ་ཏུ་བྱུང་ནས་ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འགྱུར་ཏེ།
en: Dt.92} There they will become mendicants and adopt chaste conduct.

source: དེ་བཞིན་གཤེགས་པ་བྱམས་པ་དེས་ཀྱང་། དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རོ།
en: The tathāgata Maitreya too will prophesy them to attain unsurpassed, complete enlightenment.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས། དེའི་ཚེ་འཁོར་བཞི་པོ་དེ་དག་འདི་ན་འཁོད་བཞིན་དུ། ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་མཐོང་བར་གྱུར་ཏོ། །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་མཐོང་བར་གྱུར་ཏོ།
en: Then, through the power of the Buddha, the four assemblies who were present on that occasion beheld the thousand buddhafields of the eastern direction, and they beheld the thousand buddhafields of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་ཕྱེ་བ་གང་ཇི་ལྟ་བུར་མཐོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་ཕྱེ་བ་དེ་དག་ཀྱང་། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་ཡོད་པར་མ་མཐོང་ངོ་།
en: In this world of Patient Endurance they did not see any attributes of the buddhafields as distinguished as those of the fields of those lord buddhas that they beheld in those world realms.

source: །དེ་ནས་འཁོར་དེའི་ནང་ནས་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུས་བདག་ཅག་གིས་ལས་གང་བྱས་པས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ལས་སྤྱད་པར་བྱའོ་ཞེས་སྨོན་ལམ་བཏབ་པོ།
en: Ten thousand living creatures in that assembly then made the following aspiration: “Let us generate the merits through which we will be reborn in those buddhafields!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་ཞལ་འཛུམ་པ་མཛད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས།
en: Comprehending the wishes of those noble children, the Blessed One again smiled.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་བཞད་པ་མི་མཛད་ན། ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་ཞལ་འཛུམ་པ་མཛད། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་མཐོང་ངམ།
en: The venerable Ānanda, rising from his seat, with his upper robe over one shoulder, rested his right knee on the ground and, placing his hands together in the gesture of homage, bowed toward the Blessed One, and asked, “Blessed Lord, since the tathāgatas, arhats, completely awakened buddhas do not smile without reason and circumstances, what is the reason and what are the circumstances for your smile?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་ནི་འདི་ནས་ཤི་འཕོས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་རོ།
en: The Blessed One replied, “Ānanda, when these ten thousand living creatures have passed away from here, they will be reborn in those buddhafields.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་ཡང་ནམ་དུ་ཡང་མི་འབྲལ་ཏེ།
en: Nowhere will they be separated from the fields of the tathāgatas, arhats, completely awakened buddhas.

source: ཕྱི་མའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཤ་སྟག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་ཆེན་པོའི་བུ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་ཤེས་པའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུངས་ཆེན་པོ་དང་། དགེ་སློང་གཞན་དག་ཀྱང་ཀུན་གྱིས་མངོན་པར་ཤེས་པ་ཤིན་ཏུ་མང་བ་དག་དང་།
en: In the future, they will all emerge in the world as tathāgatas, arhats, completely awakened buddhas named Vyūharāja.” {

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་མང་བ་དག་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཤིན་ཏུ་མང་བ་དག་གིས།
en: Dt.93} Then the venerable Śāradvatīputra, the venerable Mahā­maudgalyāyana, the venerable Subhūti, the venerable Pūrṇa Maitrāyaṇīputra, the venerable Mahākāśyapa, and a multitude of other monks, all of whom had extrasensory powers, as well as a multitude of bodhisattva great beings, and a multitude of monks, nuns, laymen, and laywomen, all addressed the Blessed One as follows. “

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོའོ།
en: Blessed Lord, this perfection of wisdom is the great perfection of bodhisattva great beings.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡངས་པའོ།
en: Blessed Lord, this perfection of wisdom is the vast perfection of bodhisattva great beings.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དམ་པའོ།
en: This perfection is sacred.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རབ་པོ།
en: This perfection is the best.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཕུལ་ལོ།
en: This perfection is perfect.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཆོག་གོ།
en: This perfection is supreme.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གྱ་ནོམ་པའོ།
en: This perfection is excellent.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བཟང་པོའོ།
en: This perfection is noble.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བླ་ན་མ་མཆིས་པའོ།
en: This perfection is unsurpassed.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ལྟག་ན་མ་མཆིས་པའོ།
en: This perfection is the highest.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཉམ་པ་མ་མཆིས་པའོ།
en: This perfection is unequaled.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་མཉམ་པ་དང་མཉམ་པའོ།
en: This perfection is equal to the unequaled.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདྲ་བ་མ་མཆིས་པའོ།
en: This perfection is not replicated.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཚུངས་པ་མ་མཆིས་པའོ།
en: This perfection is incomparable.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ནམ་མཁའ་འོ།
en: This perfection is like space. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དོ།
en: Blessed Lord, this perfection of bodhisattva great beings is the emptiness of intrinsic defining characteristics.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དོ།
en: Blessed Lord, this perfection of bodhisattva great beings is the emptiness of all phenomena.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དོ།
en: Blessed Lord, this perfection of bodhisattva great beings is the emptiness of the essential nature of nonentities.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའོ།
en: Blessed Lord, this perfection of bodhisattva great beings is perfect in all enlightened attributes.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: Blessed Lord, this perfection of bodhisattva great beings is endowed with all enlightened attributes.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐུབ་པ་མ་མཆིས་པའོ།
en: Blessed Lord, this is because the perfection of bodhisattva great beings is uncrushable. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི། མི་མཉམ་པ་དང་མཉམ་པའི་སྦྱིན་པ་ཡོངས་སུ་བཏང་ངོ་། །ཡོངས་སུ་གཏོང་ངོ་། །ཡོངས་སུ་གཏོང་བར་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have bestowed, are bestowing, and will bestow generosity that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect generosity that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ལུས་ཐོབ་པར་གྱུར་ཏོ། །ཐོབ་པོ། །འཐོབ་པར་འགྱུར་རོ།
en: To that end they have acquired, are acquiring, and will acquire a physical form that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏོ། །ཐོབ་པོ། འཐོབ་པར་འགྱུར་རོ།
en: To that end they have attained, are attaining, and will attain attributes that are equal to the unequaled—unsurpassed, complete enlightenment. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི། མི་མཉམ་པ་དང་མཉམ་པའི་ཚུལ་ཁྲིམས་བསྲུངས་སོ། །སྲུང་ངོ་། །སྲུང་བར་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have maintained, are maintaining, and will maintain ethical discipline that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect ethical discipline that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ལུས་ཐོབ་པར་གྱུར་ཏོ། །ཐོབ་པོ། འཐོབ་པར་འགྱུར་རོ།
en: To that end they have acquired, are acquiring, and will acquire a physical form that is equal to the unequaled.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི། མི་མཉམ་པ་དང་མཉམ་པའི་བཟོད་པ་བསྒོམས་སོ། །སྒོམ་མོ། །སྒོམ་པར་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have cultivated, are cultivating, and will cultivate tolerance that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect tolerance that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏོ། །ཐོབ་པོ། །འཐོབ་པར་འགྱུར་རོ།
en: To that end they have attained, are attaining, and will attain attributes that are equal to the unequaled—unsurpassed, complete enlightenment. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་བརྩོན་འགྲུས་བརྩམས་སོ། །རྩོམ་མོ། །རྩོམ་པར་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have undertaken, are undertaking, and will undertake perseverance that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect perseverance that is equal to the unequaled.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་བསམ་གཏན་བསྐྱེད་དོ། །སྐྱེད་དོ། །སྐྱེད་པར་འགྱུར་རོ།
en: Dt.94} “Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have developed, are developing, and will develop meditative concentration that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect meditative concentration that is equal to the unequaled.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ནི། མི་མཉམ་པ་དང་མཉམ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་སོ། །སྒོམ་མོ། །སྒོམ་པར་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom have cultivated, are cultivating, and will cultivate wisdom that is equal to the unequaled.

source: །དེའི་སླད་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: To that end they have perfected, are perfecting, and will perfect wisdom that is equal to the unequaled.

source: །བཅོམ་ལྡན་འདས། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་པས་མི་མཉམ་པ་དང་མཉམ་པའི་གཟུགས་བརྙེས་པར་གྱུར་ཏོ། །མི་མཉམ་པ་དང་མཉམ་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་མི་མཉམ་པ་དང་མཉམ་པའི་རྣམ་པར་ཤེས་པ་བརྙེས་པར་གྱུར་ཏོ།
en: Blessed Lord, you too, O Lord, through practicing this perfection of wisdom, acquired physical forms that are equal to the unequaled; you acquired feelings, perceptions, and formative predispositions that are equal to the unequaled, and you acquired consciousness that is equal to the unequaled.

source: །མི་མཉམ་པ་དང་མཉམ་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་བྱང་ཆུབ་ནས། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གྱུར་ཏོ། །འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། མ་བྱོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་།
en: Having manifestly awakened to enlightenment that is equal to the unequaled, you turned the wheel of the Dharma that is equal to the unequaled. “

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་པས། མི་མཉམ་པ་དང་མཉམ་པའི་གཟུགས་བརྙེས་པར་གྱུར་ཏོ། །བརྙེས་སོ། །བརྙེས་པར་འགྱུར་རོ། །མི་མཉམ་པ་དང་མཉམ་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་མི་མཉམ་པ་དང་མཉམ་པའི་རྣམ་པར་ཤེས་པ་བརྙེས་པར་གྱུར་ཏོ།
en: It is through practicing this perfection of wisdom, too, that the lord buddhas of the past, the lord buddhas of the future, and the lord buddhas of the present have acquired, will acquire, and are acquiring physical forms that are equal to the unequaled; they have acquired, will acquire, and are acquiring feelings, perceptions, and formative predispositions that are equal to the unequaled, and they have acquired, will acquire, and are acquiring consciousness that is equal to the unequaled.

source: །བརྙེས་སོ། །བརྙེས་པར་འགྱུར་རོ། །མི་མཉམ་པ་དང་མཉམ་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གྱུར་ཏོ། །སྐོར་རོ།
en: Having attained consummate buddhahood in enlightenment that is equal to the unequaled, they have turned, will turn, and are turning the wheel of the Dharma that is equal to the unequaled. “
